constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2306                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          50;
        startFace       89350;
    }
    gasjet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          600;
        startFace       89400;
    }
    outlet
    {
        type            patch;
        nFaces          650;
        startFace       90000;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          90000;
        startFace       90650;
    }
)

// ************************************************************************* //
