0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        // type            fixedValue;
        // value           uniform (288 0 0);            //uniform (0 0 852);
        // type            zeroGradient;
        // type            pressureInletOutletVelocity;
        // value           uniform (0 0 0);
        // type            pressureInletUniformVelocity;
        // value           uniform (1 0 0);
        type            outletInlet;
        outletValue     uniform (0 0 0);
        value           uniform (0 0 0);
    }

    outlet
    {
        // type            inletOutlet;
        // value           $internalField;
        // inletValue      $internalField;
        type            zeroGradient;
    }

    gasjet
    {
        // type            maxwellSlipU;
        // accommodationCoeff 1;
        // Uwall           uniform (0 0 0);
        // thermalCreep    on;
        // curvature       on;
        type            noSlip;
    }

    // open
    // {
    //     type            zeroGradient;
    // }

}

// ************************************************************************* //
