0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1333; // 1e-2 torr

boundaryField
{
    inlet
    {
        type            totalPressure;
        rho             none;
        psi             thermo:psi;
        gamma           1.667;
        p0              uniform 273721.972; //25psig;
        value           uniform 133599.2466; //aub sonic 144590;
    }

    outlet
    {
        type            zeroGradient;
    }

    gasjet
    {
        type            zeroGradient;
    }

    // open
    // {
    //     type            zeroGradient;
    // }

}

// ************************************************************************* //
