0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 287;

boundaryField
{
    inlet
    {
        // type            fixedValue;
        // value           uniform 287;
        type            zeroGradient;
    }

    outlet
    {
        type            zeroGradient;
        // type            fixedValue;
        // value           uniform 287;
    }

    gasjet
    {
        type            zeroGradient;
        // type            fixedValue;
        // value           uniform 287;
    }

    // open
    // {
    //     // type            zeroGradient;
    //     type            fixedValue;
    //     value           uniform 287;
    // }


}

// ************************************************************************* //
