system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v3.0+                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
	volScalarFieldValue p 13.33 // 0.01 torr
	volVectorFieldValue	U (0 0 0)
);

regions         
	( 
		boxToCell { 
			box (-1 -1 -1) (-0.025 1 1); 
			fieldValues 
			(
				volScalarFieldValue p 273721.9
				volVectorFieldValue U (0 0 0)
			); 
		} 
	);


// ************************************************************************* //
